
{
  "answer1": {
    "text": "For behavioral interviews, try the STAR method — Situation, Task, Action, Result. Think of 4–5 strong stories that demonstrate teamwork, communication, and problem-solving. Also, practice out loud — it helps make your answers sound more natural.",
    "ansBy": "l.knope",
    "ansDateTime": "2025-03-10T11:42:18Z",
    "comments": ["comment8"]
  },
  "answer2": {
    "text": "You can keep one master resume and tweak it depending on the role. For consulting, highlight communication, leadership, and problem-solving. For tech, emphasize technical skills and projects. A one-size-fits-all resume usually doesn’t work well.",
    "ansBy": "b.wyatt",
    "ansDateTime": "2025-03-15T09:18:27Z",
    "comments": ["comment9"]
  },
  "answer3": {
    "text": "Ask genuine questions about the speaker’s work — people love talking about their experiences. Follow up with a short LinkedIn message afterward. Even a quick 'thanks for sharing your insights' can go a long way.",
    "ansBy": "c.bing",
    "ansDateTime": "2025-03-20T09:47:33Z",
    "comments": []
  },
  "answer4": {
    "text": "Block off time for yourself just like you would for class. I also found it helpful to use separate calendars for work and school so I could visually see my free time. And don’t underestimate the power of sleep.",
    "ansBy": "a.perkins",
    "ansDateTime": "2025-03-26T08:36:51Z",
    "comments": []
  },
  "answer5": {
    "text": "Absolutely! Keep your profile photo professional, add a summary that reflects your interests, and make sure your experiences have descriptions. Recruiters often filter by keywords — include relevant skills like 'Python', 'UX', or 'data analysis.'",
    "ansBy": "n.wheeler",
    "ansDateTime": "2025-03-31T11:27:09Z",
    "comments": []
  },
  "answer6": {
    "text": "Check Glassdoor reviews and LinkedIn posts from employees. During the interview, ask what a typical week looks like or how they celebrate team wins — those answers can reveal a lot about culture.",
    "ansBy": "r.green",
    "ansDateTime": "2025-04-03T10:15:44Z",
    "comments": ["comment10"]
  }
}
